Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Организации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// Пропускаем проверку, если запись уже отменена
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка обязательного поля Наименование
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
		Сообщить("Поле Наименование не заполнено!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка обязательного поля ИНН
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ИНН) Тогда
		Сообщить("Поле ИНН не заполнено!");
		Отказ = Истина;
		Возврат;
	ИначеЕсли СтрДлина(СокрЛП(ЭтотОбъект.ИНН)) <> 12 Тогда
		Сообщить("ИНН должен содержать ровно 12 символов!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка обязательного поля КПП
	Если Не ЗначениеЗаполнено(ЭтотОбъект.КПП) Тогда
		Сообщить("Поле КПП не заполнено!");
		Отказ = Истина;
		Возврат;
	ИначеЕсли СтрДлина(СокрЛП(ЭтотОбъект.КПП)) <> 9 Тогда
		Сообщить("КПП должен содержать ровно 9 символов!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка уникальности наименования
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Наименование = &Наименование
		|	И Организации.Ссылка <> &ТекущаяСсылка
		|	И НЕ Организации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("ТекущаяСсылка", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Сообщить("Организация с наименованием """ + ЭтотОбъект.Наименование + """ уже существует!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Автоматическое заполнение кода, если он пустой
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Код) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Организации.Код
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	НЕ Организации.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		МаксКод = 0;
		Пока Выборка.Следующий() Цикл
			// Пытаемся преобразовать код в число, игнорируя некорректные значения
			Попытка
				ТекКод = Число(Выборка.Код);
				МаксКод = Макс(МаксКод, ТекКод);
			Исключение
				// Игнорируем некорректные значения
				Продолжить;
			КонецПопытки;
		КонецЦикла;
		
		ЭтотОбъект.Код = Формат(МаксКод + 1, "ЧЦ=9; ЧВН=; ЧГ=0");
		
	КонецЕсли;
	
	// Проверка уникальности кода
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Код = &Код
		|	И Организации.Ссылка <> &ТекущаяСсылка
		|	И НЕ Организации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Код", ЭтотОбъект.Код);
	Запрос.УстановитьПараметр("ТекущаяСсылка", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Сообщить("Организация с кодом """ + ЭтотОбъект.Код + """ уже существует!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
